; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p17---int100n150-m25---int100c110---s543---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 - fuellevel
)

(:init
(sum level0 level7 level7)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level0 level21 level21)
(sum level1 level7 level8)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level1 level21 level22)
(sum level2 level7 level9)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level2 level21 level23)
(sum level3 level7 level10)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level3 level21 level24)
(sum level4 level7 level11)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level4 level21 level25)
(sum level5 level7 level12)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level5 level21 level26)
(sum level6 level7 level13)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level6 level21 level27)
(sum level7 level7 level14)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level7 level21 level28)
(sum level8 level7 level15)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level8 level21 level29)
(sum level9 level7 level16)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level9 level21 level30)
(sum level10 level7 level17)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level10 level21 level31)
(sum level11 level7 level18)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level11 level21 level32)
(sum level12 level7 level19)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level12 level21 level33)
(sum level13 level7 level20)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level13 level21 level34)
(sum level14 level7 level21)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level14 level21 level35)
(sum level15 level7 level22)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level15 level21 level36)
(sum level16 level7 level23)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level16 level21 level37)
(sum level17 level7 level24)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level17 level21 level38)
(sum level18 level7 level25)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level18 level21 level39)
(sum level19 level7 level26)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level19 level21 level40)
(sum level20 level7 level27)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level20 level21 level41)
(sum level21 level7 level28)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level21 level21 level42)
(sum level22 level7 level29)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level22 level21 level43)
(sum level23 level7 level30)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level23 level21 level44)
(sum level24 level7 level31)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level24 level21 level45)
(sum level25 level7 level32)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level25 level21 level46)
(sum level26 level7 level33)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level26 level21 level47)
(sum level27 level7 level34)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level27 level21 level48)
(sum level28 level7 level35)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level28 level21 level49)
(sum level29 level7 level36)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level29 level21 level50)
(sum level30 level7 level37)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level30 level21 level51)
(sum level31 level7 level38)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level31 level21 level52)
(sum level32 level7 level39)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level32 level21 level53)
(sum level33 level7 level40)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level33 level21 level54)
(sum level34 level7 level41)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level34 level21 level55)
(sum level35 level7 level42)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level35 level21 level56)
(sum level36 level7 level43)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level36 level21 level57)
(sum level37 level7 level44)
(sum level37 level14 level51)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level37 level21 level58)
(sum level38 level7 level45)
(sum level38 level14 level52)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level38 level21 level59)
(sum level39 level7 level46)
(sum level39 level14 level53)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level39 level21 level60)
(sum level40 level7 level47)
(sum level40 level14 level54)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level40 level21 level61)
(sum level41 level7 level48)
(sum level41 level14 level55)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level41 level21 level62)
(sum level42 level7 level49)
(sum level42 level14 level56)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level42 level21 level63)
(sum level43 level7 level50)
(sum level43 level14 level57)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level43 level21 level64)
(sum level44 level7 level51)
(sum level44 level14 level58)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level44 level21 level65)
(sum level45 level7 level52)
(sum level45 level14 level59)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level45 level21 level66)
(sum level46 level7 level53)
(sum level46 level14 level60)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level46 level21 level67)
(sum level47 level7 level54)
(sum level47 level14 level61)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level47 level21 level68)
(sum level48 level7 level55)
(sum level48 level14 level62)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level48 level21 level69)
(sum level49 level7 level56)
(sum level49 level14 level63)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level49 level21 level70)
(sum level50 level7 level57)
(sum level50 level14 level64)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level50 level21 level71)
(sum level51 level7 level58)
(sum level51 level14 level65)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level51 level21 level72)
(sum level52 level7 level59)
(sum level52 level14 level66)
(sum level52 level16 level68)
(sum level52 level17 level69)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level52 level21 level73)
(sum level53 level7 level60)
(sum level53 level14 level67)
(sum level53 level16 level69)
(sum level53 level17 level70)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level53 level21 level74)
(sum level54 level7 level61)
(sum level54 level14 level68)
(sum level54 level16 level70)
(sum level54 level17 level71)
(sum level54 level19 level73)
(sum level54 level20 level74)
(sum level54 level21 level75)
(sum level55 level7 level62)
(sum level55 level14 level69)
(sum level55 level16 level71)
(sum level55 level17 level72)
(sum level55 level19 level74)
(sum level55 level20 level75)
(sum level55 level21 level76)
(sum level56 level7 level63)
(sum level56 level14 level70)
(sum level56 level16 level72)
(sum level56 level17 level73)
(sum level56 level19 level75)
(sum level56 level20 level76)
(sum level56 level21 level77)
(sum level57 level7 level64)
(sum level57 level14 level71)
(sum level57 level16 level73)
(sum level57 level17 level74)
(sum level57 level19 level76)
(sum level57 level20 level77)
(sum level57 level21 level78)
(sum level58 level7 level65)
(sum level58 level14 level72)
(sum level58 level16 level74)
(sum level58 level17 level75)
(sum level58 level19 level77)
(sum level58 level20 level78)
(sum level58 level21 level79)
(sum level59 level7 level66)
(sum level59 level14 level73)
(sum level59 level16 level75)
(sum level59 level17 level76)
(sum level59 level19 level78)
(sum level59 level20 level79)
(sum level59 level21 level80)
(sum level60 level7 level67)
(sum level60 level14 level74)
(sum level60 level16 level76)
(sum level60 level17 level77)
(sum level60 level19 level79)
(sum level60 level20 level80)
(sum level60 level21 level81)
(sum level61 level7 level68)
(sum level61 level14 level75)
(sum level61 level16 level77)
(sum level61 level17 level78)
(sum level61 level19 level80)
(sum level61 level20 level81)
(sum level61 level21 level82)
(sum level62 level7 level69)
(sum level62 level14 level76)
(sum level62 level16 level78)
(sum level62 level17 level79)
(sum level62 level19 level81)
(sum level62 level20 level82)
(sum level62 level21 level83)
(sum level63 level7 level70)
(sum level63 level14 level77)
(sum level63 level16 level79)
(sum level63 level17 level80)
(sum level63 level19 level82)
(sum level63 level20 level83)
(sum level63 level21 level84)
(sum level64 level7 level71)
(sum level64 level14 level78)
(sum level64 level16 level80)
(sum level64 level17 level81)
(sum level64 level19 level83)
(sum level64 level20 level84)
(sum level64 level21 level85)
(sum level65 level7 level72)
(sum level65 level14 level79)
(sum level65 level16 level81)
(sum level65 level17 level82)
(sum level65 level19 level84)
(sum level65 level20 level85)
(sum level65 level21 level86)
(sum level66 level7 level73)
(sum level66 level14 level80)
(sum level66 level16 level82)
(sum level66 level17 level83)
(sum level66 level19 level85)
(sum level66 level20 level86)
(sum level66 level21 level87)
(sum level67 level7 level74)
(sum level67 level14 level81)
(sum level67 level16 level83)
(sum level67 level17 level84)
(sum level67 level19 level86)
(sum level67 level20 level87)
(sum level67 level21 level88)
(sum level68 level7 level75)
(sum level68 level14 level82)
(sum level68 level16 level84)
(sum level68 level17 level85)
(sum level68 level19 level87)
(sum level68 level20 level88)
(sum level68 level21 level89)
(sum level69 level7 level76)
(sum level69 level14 level83)
(sum level69 level16 level85)
(sum level69 level17 level86)
(sum level69 level19 level88)
(sum level69 level20 level89)
(sum level69 level21 level90)
(sum level70 level7 level77)
(sum level70 level14 level84)
(sum level70 level16 level86)
(sum level70 level17 level87)
(sum level70 level19 level89)
(sum level70 level20 level90)
(sum level70 level21 level91)
(sum level71 level7 level78)
(sum level71 level14 level85)
(sum level71 level16 level87)
(sum level71 level17 level88)
(sum level71 level19 level90)
(sum level71 level20 level91)
(sum level71 level21 level92)
(sum level72 level7 level79)
(sum level72 level14 level86)
(sum level72 level16 level88)
(sum level72 level17 level89)
(sum level72 level19 level91)
(sum level72 level20 level92)
(sum level72 level21 level93)
(sum level73 level7 level80)
(sum level73 level14 level87)
(sum level73 level16 level89)
(sum level73 level17 level90)
(sum level73 level19 level92)
(sum level73 level20 level93)
(sum level73 level21 level94)
(sum level74 level7 level81)
(sum level74 level14 level88)
(sum level74 level16 level90)
(sum level74 level17 level91)
(sum level74 level19 level93)
(sum level74 level20 level94)
(sum level74 level21 level95)
(sum level75 level7 level82)
(sum level75 level14 level89)
(sum level75 level16 level91)
(sum level75 level17 level92)
(sum level75 level19 level94)
(sum level75 level20 level95)
(sum level75 level21 level96)
(sum level76 level7 level83)
(sum level76 level14 level90)
(sum level76 level16 level92)
(sum level76 level17 level93)
(sum level76 level19 level95)
(sum level76 level20 level96)
(sum level76 level21 level97)
(sum level77 level7 level84)
(sum level77 level14 level91)
(sum level77 level16 level93)
(sum level77 level17 level94)
(sum level77 level19 level96)
(sum level77 level20 level97)
(sum level77 level21 level98)
(sum level78 level7 level85)
(sum level78 level14 level92)
(sum level78 level16 level94)
(sum level78 level17 level95)
(sum level78 level19 level97)
(sum level78 level20 level98)
(sum level78 level21 level99)
(sum level79 level7 level86)
(sum level79 level14 level93)
(sum level79 level16 level95)
(sum level79 level17 level96)
(sum level79 level19 level98)
(sum level79 level20 level99)
(sum level79 level21 level100)
(sum level80 level7 level87)
(sum level80 level14 level94)
(sum level80 level16 level96)
(sum level80 level17 level97)
(sum level80 level19 level99)
(sum level80 level20 level100)
(sum level80 level21 level101)
(sum level81 level7 level88)
(sum level81 level14 level95)
(sum level81 level16 level97)
(sum level81 level17 level98)
(sum level81 level19 level100)
(sum level81 level20 level101)
(sum level81 level21 level102)
(sum level82 level7 level89)
(sum level82 level14 level96)
(sum level82 level16 level98)
(sum level82 level17 level99)
(sum level82 level19 level101)
(sum level82 level20 level102)
(sum level82 level21 level103)
(sum level83 level7 level90)
(sum level83 level14 level97)
(sum level83 level16 level99)
(sum level83 level17 level100)
(sum level83 level19 level102)
(sum level83 level20 level103)
(sum level83 level21 level104)
(sum level84 level7 level91)
(sum level84 level14 level98)
(sum level84 level16 level100)
(sum level84 level17 level101)
(sum level84 level19 level103)
(sum level84 level20 level104)
(sum level84 level21 level105)
(sum level85 level7 level92)
(sum level85 level14 level99)
(sum level85 level16 level101)
(sum level85 level17 level102)
(sum level85 level19 level104)
(sum level85 level20 level105)
(sum level85 level21 level106)
(sum level86 level7 level93)
(sum level86 level14 level100)
(sum level86 level16 level102)
(sum level86 level17 level103)
(sum level86 level19 level105)
(sum level86 level20 level106)
(sum level86 level21 level107)
(sum level87 level7 level94)
(sum level87 level14 level101)
(sum level87 level16 level103)
(sum level87 level17 level104)
(sum level87 level19 level106)
(sum level87 level20 level107)
(sum level87 level21 level108)
(sum level88 level7 level95)
(sum level88 level14 level102)
(sum level88 level16 level104)
(sum level88 level17 level105)
(sum level88 level19 level107)
(sum level88 level20 level108)
(sum level88 level21 level109)
(sum level89 level7 level96)
(sum level89 level14 level103)
(sum level89 level16 level105)
(sum level89 level17 level106)
(sum level89 level19 level108)
(sum level89 level20 level109)
(sum level89 level21 level110)
(sum level90 level7 level97)
(sum level90 level14 level104)
(sum level90 level16 level106)
(sum level90 level17 level107)
(sum level90 level19 level109)
(sum level90 level20 level110)
(sum level90 level21 level111)
(sum level91 level7 level98)
(sum level91 level14 level105)
(sum level91 level16 level107)
(sum level91 level17 level108)
(sum level91 level19 level110)
(sum level91 level20 level111)
(sum level91 level21 level112)
(sum level92 level7 level99)
(sum level92 level14 level106)
(sum level92 level16 level108)
(sum level92 level17 level109)
(sum level92 level19 level111)
(sum level92 level20 level112)
(sum level92 level21 level113)
(sum level93 level7 level100)
(sum level93 level14 level107)
(sum level93 level16 level109)
(sum level93 level17 level110)
(sum level93 level19 level112)
(sum level93 level20 level113)
(sum level93 level21 level114)
(sum level94 level7 level101)
(sum level94 level14 level108)
(sum level94 level16 level110)
(sum level94 level17 level111)
(sum level94 level19 level113)
(sum level94 level20 level114)
(sum level94 level21 level115)
(sum level95 level7 level102)
(sum level95 level14 level109)
(sum level95 level16 level111)
(sum level95 level17 level112)
(sum level95 level19 level114)
(sum level95 level20 level115)
(sum level95 level21 level116)
(sum level96 level7 level103)
(sum level96 level14 level110)
(sum level96 level16 level112)
(sum level96 level17 level113)
(sum level96 level19 level115)
(sum level96 level20 level116)
(sum level96 level21 level117)
(sum level97 level7 level104)
(sum level97 level14 level111)
(sum level97 level16 level113)
(sum level97 level17 level114)
(sum level97 level19 level116)
(sum level97 level20 level117)
(sum level97 level21 level118)
(sum level98 level7 level105)
(sum level98 level14 level112)
(sum level98 level16 level114)
(sum level98 level17 level115)
(sum level98 level19 level117)
(sum level98 level20 level118)
(sum level98 level21 level119)
(sum level99 level7 level106)
(sum level99 level14 level113)
(sum level99 level16 level115)
(sum level99 level17 level116)
(sum level99 level19 level118)
(sum level99 level20 level119)
(sum level99 level21 level120)
(sum level100 level7 level107)
(sum level100 level14 level114)
(sum level100 level16 level116)
(sum level100 level17 level117)
(sum level100 level19 level119)
(sum level100 level20 level120)
(sum level100 level21 level121)
(sum level101 level7 level108)
(sum level101 level14 level115)
(sum level101 level16 level117)
(sum level101 level17 level118)
(sum level101 level19 level120)
(sum level101 level20 level121)
(sum level101 level21 level122)
(sum level102 level7 level109)
(sum level102 level14 level116)
(sum level102 level16 level118)
(sum level102 level17 level119)
(sum level102 level19 level121)
(sum level102 level20 level122)
(sum level102 level21 level123)
(sum level103 level7 level110)
(sum level103 level14 level117)
(sum level103 level16 level119)
(sum level103 level17 level120)
(sum level103 level19 level122)
(sum level103 level20 level123)
(sum level103 level21 level124)
(sum level104 level7 level111)
(sum level104 level14 level118)
(sum level104 level16 level120)
(sum level104 level17 level121)
(sum level104 level19 level123)
(sum level104 level20 level124)
(sum level105 level7 level112)
(sum level105 level14 level119)
(sum level105 level16 level121)
(sum level105 level17 level122)
(sum level105 level19 level124)
(sum level106 level7 level113)
(sum level106 level14 level120)
(sum level106 level16 level122)
(sum level106 level17 level123)
(sum level107 level7 level114)
(sum level107 level14 level121)
(sum level107 level16 level123)
(sum level107 level17 level124)
(sum level108 level7 level115)
(sum level108 level14 level122)
(sum level108 level16 level124)
(sum level109 level7 level116)
(sum level109 level14 level123)
(sum level110 level7 level117)
(sum level110 level14 level124)
(sum level111 level7 level118)
(sum level112 level7 level119)
(sum level113 level7 level120)
(sum level114 level7 level121)
(sum level115 level7 level122)
(sum level116 level7 level123)
(sum level117 level7 level124)

(connected l0 l1)
(fuelcost level21 l0 l1)
(connected l0 l2)
(fuelcost level7 l0 l2)
(connected l0 l3)
(fuelcost level19 l0 l3)
(connected l1 l0)
(fuelcost level21 l1 l0)
(connected l1 l2)
(fuelcost level14 l1 l2)
(connected l1 l3)
(fuelcost level20 l1 l3)
(connected l2 l0)
(fuelcost level7 l2 l0)
(connected l2 l1)
(fuelcost level14 l2 l1)
(connected l2 l3)
(fuelcost level17 l2 l3)
(connected l3 l0)
(fuelcost level19 l3 l0)
(connected l3 l1)
(fuelcost level20 l3 l1)
(connected l3 l2)
(fuelcost level17 l3 l2)
(connected l3 l4)
(fuelcost level16 l3 l4)
(connected l4 l3)
(fuelcost level16 l4 l3)

(at t0 l0)
(fuel t0 level124)
(= (total-cost) 0)

(at p0 l0)
(at p1 l2)
(at p2 l2)
(at p3 l1)
(at p4 l0)
(at p5 l4)
(at p6 l0)
(at p7 l2)
(at p8 l4)
(at p9 l3)
(at p10 l0)
(at p11 l3)
(at p12 l0)
(at p13 l0)
(at p14 l3)
(at p15 l1)
(at p16 l0)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l4)
(at p3 l2)
(at p4 l4)
(at p5 l2)
(at p6 l4)
(at p7 l4)
(at p8 l2)
(at p9 l0)
(at p10 l4)
(at p11 l0)
(at p12 l3)
(at p13 l2)
(at p14 l1)
(at p15 l4)
(at p16 l3)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 17
2. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 17
3. (load p16 t0 l0)
   deleted: (at p16 l0)
   added: (in p16 t0)
   goals met: 0 of 17
4. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 0 of 17
5. (load p12 t0 l0)
   deleted: (at p12 l0)
   added: (in p12 t0)
   goals met: 0 of 17
6. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 17
7. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 17
8. (drive t0 l0 l2 level117 level7 level124)
   deleted: (at t0 l0) (fuel t0 level124)
   added: (at t0 l2) (fuel t0 level117)
   goals met: 0 of 17
9. (unload p13 t0 l2)
   deleted: (in p13 t0)
   added: (at p13 l2)
   goals met: 1 of 17
10. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 1 of 17
11. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 1 of 17
12. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 17
13. (drive t0 l2 l1 level103 level14 level117)
   deleted: (at t0 l2) (fuel t0 level117)
   added: (at t0 l1) (fuel t0 level103)
   goals met: 1 of 17
14. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 1 of 17
15. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 1 of 17
16. (drive t0 l1 l3 level83 level20 level103)
   deleted: (at t0 l1) (fuel t0 level103)
   added: (at t0 l3) (fuel t0 level83)
   goals met: 1 of 17
17. (drive t0 l3 l4 level67 level16 level83)
   deleted: (at t0 l3) (fuel t0 level83)
   added: (at t0 l4) (fuel t0 level67)
   goals met: 1 of 17
18. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 1 of 17
19. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 1 of 17
20. (unload p10 t0 l4)
   deleted: (in p10 t0)
   added: (at p10 l4)
   goals met: 2 of 17
21. (unload p15 t0 l4)
   deleted: (in p15 t0)
   added: (at p15 l4)
   goals met: 3 of 17
22. (unload p2 t0 l4)
   deleted: (in p2 t0)
   added: (at p2 l4)
   goals met: 4 of 17
23. (unload p4 t0 l4)
   deleted: (in p4 t0)
   added: (at p4 l4)
   goals met: 5 of 17
24. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 6 of 17
25. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 7 of 17
26. (drive t0 l4 l3 level51 level16 level67)
   deleted: (at t0 l4) (fuel t0 level67)
   added: (at t0 l3) (fuel t0 level51)
   goals met: 7 of 17
27. (load p11 t0 l3)
   deleted: (at p11 l3)
   added: (in p11 t0)
   goals met: 7 of 17
28. (load p14 t0 l3)
   deleted: (at p14 l3)
   added: (in p14 t0)
   goals met: 7 of 17
29. (load p9 t0 l3)
   deleted: (at p9 l3)
   added: (in p9 t0)
   goals met: 7 of 17
30. (unload p12 t0 l3)
   deleted: (in p12 t0)
   added: (at p12 l3)
   goals met: 8 of 17
31. (unload p16 t0 l3)
   deleted: (in p16 t0)
   added: (at p16 l3)
   goals met: 9 of 17
32. (drive t0 l3 l0 level32 level19 level51)
   deleted: (at t0 l3) (fuel t0 level51)
   added: (at t0 l0) (fuel t0 level32)
   goals met: 9 of 17
33. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 10 of 17
34. (unload p9 t0 l0)
   deleted: (in p9 t0)
   added: (at p9 l0)
   goals met: 11 of 17
35. (drive t0 l0 l2 level25 level7 level32)
   deleted: (at t0 l0) (fuel t0 level32)
   added: (at t0 l2) (fuel t0 level25)
   goals met: 11 of 17
36. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 12 of 17
37. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 13 of 17
38. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 14 of 17
39. (drive t0 l2 l1 level11 level14 level25)
   deleted: (at t0 l2) (fuel t0 level25)
   added: (at t0 l1) (fuel t0 level11)
   goals met: 14 of 17
40. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 15 of 17
41. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 16 of 17
42. (unload p14 t0 l1)
   deleted: (in p14 t0)
   added: (at p14 l1)
   goals met: 17 of 17
